Revit 2027 API
ParameterTypeId.RebarShapeEndHookLength Property
 "End Hook Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeEndHookLength { get; }
Public Shared ReadOnly Property RebarShapeEndHookLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeEndHookLength {
	ForgeTypeId^ get ();
}
static member RebarShapeEndHookLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace